---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\tarozzino\Dropbox\Experimental\AERR\Final\Stata\table1_randomization.log
  log type:  text
 opened on:  12 Oct 2013, 13:06:05

. * HOUSEHOLD-LEVEL BASELINE INFORMATION;
. use "hhinfo_bl";
(Sample frame: All BISWA Census villages with no GOI now or planned for 2007 SRS)

. gen pcexp = (totexp_bl/hhsize)/30;

. gen pcexp_nof = (totexp_nof_bl/hhsize)/30;

. gen anynet = pcnets>0 & pcnets<.;

. gen debt = debtot_bl/(totexp_bl*12);
(1 missing value generated)

. gen debtbiswa = debtbiswa_bl/(totexp_bl*12);
(1 missing value generated)

. * For the CPI deflators see caption of Table 1;
. gen poor = (totexp_bl/hhsize) < 326*(373/319.5);

. matrix results = J(1,10,.);

. gen control=vtype==1;

. cap program drop thisreg;

. prog define thisreg;
  1. syntax varlist, [Weight(varname)];
  2.                 if "`weight'" ~= "" {;
  3.                 reg `varlist' control free mf [pw=`weight'], nocon cluster(id_v);
  4.                 };
  5.         else {;
  6.                 reg `varlist' control free mf, nocon cluster(id_v);
  7.         };
  8.         matrix temp = [_b[control],_se[control],_b[free],_se[free],_b[mf],_se[mf],.,.,.,.];
  9.         test control=free=mf;
 10.         matrix temp[1,7]=r(p);
 11.                 if "`weight'" ~= "" {;
 12.                 sum `varlist' [w=`weight'];
 13.                 };
 14.         else {;
 15.                 sum `varlist';
 16.         };
 17.                 mat temp[1,8]=r(mean);
 18.         mat temp[1,9]=r(sd);
 19.         mat temp[1,10]=r(N);
 20.                 matrix rowname temp = `varlist';
 21.         matrix results=results\temp;
 22. end;

. *** This will estimate the statistics for the variables in Table 1, rows 1-18;
. foreach var of varlist scstobc_bl hhsize_bl dem_u5_bl head_male_bl head_anysch_bl head_highed_bl {;
  2.         thisreg `var';
  3.         };

Linear regression                                      Number of obs =    1838
                                                       F(  3,   140) = 4104.38
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.9300
                                                       Root MSE      =  .25532

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
  scstobc_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .9446309   .0130783    72.23   0.000     .9187743    .9704874
        free |      .9328   .0129809    71.86   0.000      .907136     .958464
          mf |   .9124797   .0207577    43.96   0.000     .8714407    .9535188
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    0.87
            Prob > F =    0.4207

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  scstobc_bl |      1838     .929815     .255528          0          1

Linear regression                                      Number of obs =    1844
                                                       F(  3,   140) = 2952.43
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.8584
                                                       Root MSE      =  2.2189

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
   hhsize_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   5.465776   .1034264    52.85   0.000     5.261297    5.670256
        free |   5.593301   .1172202    47.72   0.000     5.361551    5.825052
          mf |   5.309061   .0862648    61.54   0.000     5.138511    5.479612
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    2.01
            Prob > F =    0.1377

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   hhsize_bl |      1844    5.456616    2.220793          1         21

Linear regression                                      Number of obs =    1844
                                                       F(  3,   140) =  287.85
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3332
                                                       Root MSE      =  .70417

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
   dem_u5_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .4991653    .032795    15.22   0.000     .4343277    .5640028
        free |   .5055821   .0301779    16.75   0.000     .4459188    .5652454
          mf |    .487055   .0259901    18.74   0.000     .4356711    .5384389
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    0.11
            Prob > F =    0.8921

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   dem_u5_bl |      1844    .4972885    .7038328          0          4

Linear regression                                      Number of obs =    1843
                                                       F(  3,   140) = 8776.80
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.9415
                                                       Root MSE      =  .23493

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
head_male_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |    .951505   .0094664   100.51   0.000     .9327895    .9702205
        free |   .9409888   .0108685    86.58   0.000     .9195013    .9624764
          mf |   .9320388   .0099746    93.44   0.000     .9123185    .9517592
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    1.01
            Prob > F =    0.3680

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
head_male_bl |      1843    .9413999    .2349385          0          1

Linear regression                                      Number of obs =    1828
                                                       F(  3,   140) = 1171.64
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.7134
                                                       Root MSE      =  .45253

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
head_anysc~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .7200675   .0176559    40.78   0.000     .6851609     .754974
        free |     .70626   .0265594    26.59   0.000     .6537506    .7587694
          mf |   .7140523   .0211067    33.83   0.000     .6723233    .7557813
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    0.10
            Prob > F =    0.9084

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
head_anysc~l |      1828    .7133479    .4523213          0          1

Linear regression                                      Number of obs =    1809
                                                       F(  3,   140) =   40.06
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0938
                                                       Root MSE      =  .28686

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
head_highe~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .0836177    .016382     5.10   0.000     .0512296    .1160059
        free |   .0745543   .0127717     5.84   0.000     .0493039    .0998047
          mf |   .1138614   .0146943     7.75   0.000     .0848099    .1429129
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    2.12
            Prob > F =    0.1235

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
head_highe~l |      1809    .0906578    .2872013          0          1

. foreach var of varlist pcexp poor {;
  2.         thisreg `var', w(hhsize);
  3.         };
(sum of wgt is   1.0062e+04)

Linear regression                                      Number of obs =    1844
                                                       F(  3,   140) =  572.11
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6614
                                                       Root MSE      =  16.158

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
       pcexp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   22.29111   .9278087    24.03   0.000     20.45678    24.12543
        free |   21.15566   .8270284    25.58   0.000     19.52058    22.79074
          mf |   24.23848   1.100909    22.02   0.000     22.06192    26.41504
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    2.51
            Prob > F =    0.0852

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
       pcexp |    1844       10062    22.53036   16.19987          0   225.9136
(sum of wgt is   1.0062e+04)

Linear regression                                      Number of obs =    1844
                                                       F(  3,   140) =   62.18
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2131
                                                       Root MSE      =  .40781

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
        poor |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .1951741   .0252814     7.72   0.000     .1451914    .2451568
        free |    .239521   .0305505     7.84   0.000      .179121    .2999209
          mf |   .1962816   .0242565     8.09   0.000     .1483253    .2442379
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    0.77
            Prob > F =    0.4635

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
        poor |    1844       10062    .2109919   .4081233          0          1

. foreach var of varlist hard500_bl debt anynet {;
  2.         thisreg `var';
  3.         };

Linear regression                                      Number of obs =    1842
                                                       F(  3,   140) =  414.52
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5315
                                                       Root MSE      =   .4994

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
  hard500_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .5292154    .025435    20.81   0.000      .478929    .5795018
        free |       .536    .028813    18.60   0.000     .4790352    .5929648
          mf |   .5291262   .0245486    21.55   0.000     .4805923    .5776602
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    0.02
            Prob > F =    0.9798

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  hard500_bl |      1842    .5314875    .4991431          0          1

Linear regression                                      Number of obs =    1843
                                                       F(  3,   140) =   67.17
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1486
                                                       Root MSE      =  1.0079

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
        debt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .4704934   .0823555     5.71   0.000     .3076722    .6333147
        free |   .3891712   .0477885     8.14   0.000     .2946907    .4836517
          mf |   .3998345    .039485    10.13   0.000     .3217705    .4778984
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    0.38
            Prob > F =    0.6849

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        debt |      1843    .4191335    1.007985          0   20.39326

Linear regression                                      Number of obs =    1844
                                                       F(  3,   140) =  615.27
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6547
                                                       Root MSE      =  .47561

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
      anynet |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |    .654424   .0300648    21.77   0.000     .5949842    .7138638
        free |   .6283892   .0286087    21.96   0.000     .5718282    .6849501
          mf |   .6796117   .0227864    29.83   0.000     .6345617    .7246616
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    0.99
            Prob > F =    0.3733

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      anynet |      1844     .654013     .475818          0          1

. foreach var of varlist pcnets_bl pcitns_bl {;
  2.         thisreg `var', w(hhsize);
  3.         };
(sum of wgt is   1.0012e+04)

Linear regression                                      Number of obs =    1836
                                                       F(  3,   140) =  247.93
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4804
                                                       Root MSE      =  .29948

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
   pcnets_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .2874307   .0199721    14.39   0.000     .2479447    .3269167
        free |   .2640433   .0175352    15.06   0.000     .2293753    .2987114
          mf |   .3114452   .0176908    17.60   0.000     .2764695    .3464209
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    1.81
            Prob > F =    0.1673

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
   pcnets_bl |    1836       10012    .2870555   .2999544          0          4
(sum of wgt is   9.9820e+03)

Linear regression                                      Number of obs =    1831
                                                       F(  3,   140) =   13.70
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0807
                                                       Root MSE      =  .14577

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
   pcitns_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |    .020679   .0058914     3.51   0.001     .0090314    .0323267
        free |   .0455587    .013147     3.47   0.001     .0195665     .071551
          mf |   .0553506    .013519     4.09   0.000     .0286229    .0820783
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    3.69
            Prob > F =    0.0274

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
   pcitns_bl |    1831        9982    .0406732   .1464029          0          1

. thisreg costm_bl;

Linear regression                                      Number of obs =    1844
                                                       F(  3,   140) =   73.54
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1338
                                                       Root MSE      =  1688.4

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
    costm_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   564.7012   76.94283     7.34   0.000     412.5811    716.8213
        free |   724.7783   71.65941    10.11   0.000     583.1038    866.4528
          mf |    685.568   85.38237     8.03   0.000     516.7624    854.3735
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    1.22
            Prob > F =    0.2982

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    costm_bl |      1844    659.6383    1688.895          0      29900

. foreach var of varlist last_net_bl last_itn_bl usual_net_bl {;
  2.         thisreg `var', w(hhsize);
  3.         };
(sum of wgt is   1.0062e+04)

Linear regression                                      Number of obs =    1844
                                                       F(  3,   140) =   52.84
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1786
                                                       Root MSE      =  .29457

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
 last_net_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .1309633   .0223868     5.85   0.000     .0867034    .1752231
        free |   .1163126   .0187174     6.21   0.000     .0793074    .1533179
          mf |   .1618881   .0174895     9.26   0.000     .1273103    .1964658
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    1.65
            Prob > F =    0.1952

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
 last_net_bl |    1844       10062    .1359408   .2950274          0          1
(sum of wgt is   1.0045e+04)

Linear regression                                      Number of obs =    1840
                                                       F(  3,   140) =   10.94
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0323
                                                       Root MSE      =  .13376

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
 last_itn_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .0194219   .0056923     3.41   0.001     .0081679    .0306758
        free |   .0221913   .0066179     3.35   0.001     .0091075    .0352752
          mf |   .0304807   .0096745     3.15   0.002     .0113538    .0496076
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    0.49
            Prob > F =    0.6165

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
 last_itn_bl |    1840       10045    .0239899   .1337693          0          1
(sum of wgt is   1.0062e+04)

Linear regression                                      Number of obs =    1844
                                                       F(  3,   140) =  334.82
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5958
                                                       Root MSE      =  .45259

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
usual_net_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .5642174   .0322274    17.51   0.000     .5005021    .6279326
        free |   .5117684   .0299312    17.10   0.000     .4525928     .570944
          mf |    .571565   .0283806    20.14   0.000     .5154551    .6276749
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    1.20
            Prob > F =    0.3040

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
usual_net_bl |    1844       10062    .5483328    .453149          0          1

. thisreg price, w(n_price);
(sum of wgt is   5.8100e+02)

Linear regression                                      Number of obs =     332
                                                       F(  3,   107) =  108.12
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6484
                                                       Root MSE      =  58.762

                                 (Std. Err. adjusted for 108 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
    price_bl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   83.04813   8.176086    10.16   0.000     66.83999    99.25627
        free |   83.52071   8.405443     9.94   0.000      66.8579    100.1835
          mf |   72.93333   6.590675    11.07   0.000     59.86809    85.99858
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   107) =    0.69
            Prob > F =    0.5045

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
    price_bl |     332         581     79.2685    58.8013          0        800

. * Note that in Table 1 the number of observations is 579, not 332 as in the results produced by this code. That's because there are 3
> 32 households
> * with non-missing price data on owned bednets, but there are a total of 579 such bednets;
. matrix colnames results = control se_control Free se_Free MF se_MF p Mean StDev Obs;

. matrix results = results[2...,1...];

. mat list results, format(%10.3g);

results[18,10]
                   control  se_control        Free     se_Free          MF       se_MF           p        Mean       StDev         Obs
    scstobc_bl        .945       .0131        .933        .013        .912       .0208        .421         .93        .256        1838
     hhsize_bl        5.47        .103        5.59        .117        5.31       .0863        .138        5.46        2.22        1844
     dem_u5_bl        .499       .0328        .506       .0302        .487        .026        .892        .497        .704        1844
  head_male_bl        .952      .00947        .941       .0109        .932      .00997        .368        .941        .235        1843
head_anysch_bl         .72       .0177        .706       .0266        .714       .0211        .908        .713        .452        1828
head_highed_bl       .0836       .0164       .0746       .0128        .114       .0147        .123       .0907        .287        1809
         pcexp        22.3        .928        21.2        .827        24.2         1.1       .0852        22.5        16.2        1844
          poor        .195       .0253         .24       .0306        .196       .0243        .463        .211        .408        1844
    hard500_bl        .529       .0254        .536       .0288        .529       .0245         .98        .531        .499        1842
          debt         .47       .0824        .389       .0478          .4       .0395        .685        .419        1.01        1843
        anynet        .654       .0301        .628       .0286         .68       .0228        .373        .654        .476        1844
     pcnets_bl        .287         .02        .264       .0175        .311       .0177        .167        .287          .3        1836
     pcitns_bl       .0207      .00589       .0456       .0131       .0554       .0135       .0274       .0407        .146        1831
      costm_bl         565        76.9         725        71.7         686        85.4        .298         660        1689        1844
   last_net_bl        .131       .0224        .116       .0187        .162       .0175        .195        .136        .295        1844
   last_itn_bl       .0194      .00569       .0222      .00662       .0305      .00967        .617        .024        .134        1840
  usual_net_bl        .564       .0322        .512       .0299        .572       .0284        .304        .548        .453        1844
      price_bl          83        8.18        83.5        8.41        72.9        6.59        .504        79.3        58.8         332

. *** Now estimate the statistics in rows 19-23 from the file that includes individual-level health outcomes and display full table
> * of results;
. use "panel_biomarkers" if inlist(match,0,1,6), clear;

. gen an0 = hb0<11 if hb0<.;
(8452 missing values generated)

. rename arm_c control;

. rename arm_mf mf;

. rename arm_free free;

. foreach var of varlist m0 hb0 an0 survey_m60 survey_mf60 {;
  2.         thisreg `var';
  3.         };

Linear regression                                      Number of obs =    2557
                                                       F(  3,   140) =   44.54
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1157
                                                       Root MSE      =   .3196

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
          m0 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .1082045   .0158757     6.82   0.000     .0768174    .1395917
        free |   .1153846   .0176439     6.54   0.000     .0805017    .1502675
          mf |   .1225962   .0183994     6.66   0.000     .0862196    .1589727
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    0.18
            Prob > F =    0.8384

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
          m0 |      2557    .1153696    .3195299          0          1

Linear regression                                      Number of obs =    2528
                                                       F(  3,   140) =14882.44
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.9704
                                                       Root MSE      =  1.9027

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
         hb0 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   10.96194   .0868273   126.25   0.000     10.79028    11.13361
        free |    10.7433    .095771   112.18   0.000     10.55395    10.93264
          mf |   10.98345   .0864957   126.98   0.000     10.81245    11.15446
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    2.05
            Prob > F =    0.1324

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         hb0 |      2528    10.89343    1.905065        3.3       19.4

Linear regression                                      Number of obs =    2528
                                                       F(  3,   140) =  554.43
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5354
                                                       Root MSE      =  .49839

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
         an0 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .5270108   .0238286    22.12   0.000     .4799004    .5741212
        free |   .5693013   .0248158    22.94   0.000      .520239    .6183635
          mf |   .5036496   .0197876    25.45   0.000     .4645285    .5427708
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    2.14
            Prob > F =    0.1212

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         an0 |      2528     .534019    .4989401          0          1

Linear regression                                      Number of obs =   10062
                                                       F(  3,   140) =  109.58
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1097
                                                       Root MSE      =  .32793

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
  survey_m60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .0934637   .0087645    10.66   0.000     .0761357    .1107916
        free |   .1237525   .0115991    10.67   0.000     .1008205    .1466845
          mf |   .1246571   .0123928    10.06   0.000      .100156    .1491583
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    3.18
            Prob > F =    0.0448

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  survey_m60 |     10062     .114192    .3282107          0          3

Linear regression                                      Number of obs =   10062
                                                       F(  3,   140) =  237.25
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2228
                                                       Root MSE      =  .44543

                                 (Std. Err. adjusted for 141 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
 survey_mf60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     control |   .2177764   .0145048    15.01   0.000     .1890996    .2464532
        free |   .2380952    .015069    15.80   0.000      .208303    .2678874
          mf |   .2578482   .0167605    15.38   0.000     .2247118    .2909846
------------------------------------------------------------------------------

 ( 1)  control - free = 0
 ( 2)  control - mf = 0

       F(  2,   140) =    1.65
            Prob > F =    0.1960

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
 survey_mf60 |     10062    .2379249    .4456783          0          3

. mat list results, format(%10.3g);

results[23,10]
                   control  se_control        Free     se_Free          MF       se_MF           p        Mean       StDev         Obs
    scstobc_bl        .945       .0131        .933        .013        .912       .0208        .421         .93        .256        1838
     hhsize_bl        5.47        .103        5.59        .117        5.31       .0863        .138        5.46        2.22        1844
     dem_u5_bl        .499       .0328        .506       .0302        .487        .026        .892        .497        .704        1844
  head_male_bl        .952      .00947        .941       .0109        .932      .00997        .368        .941        .235        1843
head_anysch_bl         .72       .0177        .706       .0266        .714       .0211        .908        .713        .452        1828
head_highed_bl       .0836       .0164       .0746       .0128        .114       .0147        .123       .0907        .287        1809
         pcexp        22.3        .928        21.2        .827        24.2         1.1       .0852        22.5        16.2        1844
          poor        .195       .0253         .24       .0306        .196       .0243        .463        .211        .408        1844
    hard500_bl        .529       .0254        .536       .0288        .529       .0245         .98        .531        .499        1842
          debt         .47       .0824        .389       .0478          .4       .0395        .685        .419        1.01        1843
        anynet        .654       .0301        .628       .0286         .68       .0228        .373        .654        .476        1844
     pcnets_bl        .287         .02        .264       .0175        .311       .0177        .167        .287          .3        1836
     pcitns_bl       .0207      .00589       .0456       .0131       .0554       .0135       .0274       .0407        .146        1831
      costm_bl         565        76.9         725        71.7         686        85.4        .298         660        1689        1844
   last_net_bl        .131       .0224        .116       .0187        .162       .0175        .195        .136        .295        1844
   last_itn_bl       .0194      .00569       .0222      .00662       .0305      .00967        .617        .024        .134        1840
  usual_net_bl        .564       .0322        .512       .0299        .572       .0284        .304        .548        .453        1844
      price_bl          83        8.18        83.5        8.41        72.9        6.59        .504        79.3        58.8         332
            m0        .108       .0159        .115       .0176        .123       .0184        .838        .115         .32        2557
           hb0          11       .0868        10.7       .0958          11       .0865        .132        10.9        1.91        2528
           an0        .527       .0238        .569       .0248        .504       .0198        .121        .534        .499        2528
    survey_m60       .0935      .00876        .124       .0116        .125       .0124       .0448        .114        .328       10062
   survey_mf60        .218       .0145        .238       .0151        .258       .0168        .196        .238        .446       10062

. cap log close;
