---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\tarozzino\Dropbox\Experimental\AERR\Final\Stata\table4_cash.log
  log type:  text
 opened on:  12 Oct 2013, 13:06:17

. * Import data for cash-only experiment. This includes data on LLIN demand at the household level;
. use "data_cash_hh";

. * For Table 4 use only information from households that received vouchers (that is, hh_v==1);
. * ROW A. - Number of LLINs sold, and fraction of buyers;
. reg hh_nets if hh_v==1, cluster(id_v);

Linear regression                                      Number of obs =    1728
                                                       F(  0,    39) =    0.00
                                                       Prob > F      =       .
                                                       R-squared     =  0.0000
                                                       Root MSE      =  .60934

                                  (Std. Err. adjusted for 40 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
     hh_nets |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   .1591435   .0325518     4.89   0.000     .0933012    .2249858
------------------------------------------------------------------------------

. reg hh_some if hh_v==1, cluster(id_v);

Linear regression                                      Number of obs =    1728
                                                       F(  0,    39) =    0.00
                                                       Prob > F      =       .
                                                       R-squared     =  0.0000
                                                       Root MSE      =  .31074

                                  (Std. Err. adjusted for 40 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
     hh_some |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   .1082176   .0192599     5.62   0.000     .0692608    .1471744
------------------------------------------------------------------------------

. * ROWS B and C and test of equality;
. gen PC = type=="PC";

. gen New = type=="new";

. reg hh_nets PC New if hh_v==1, cluster(id_v) nocons;

Linear regression                                      Number of obs =    1728
                                                       F(  2,    39) =   12.62
                                                       Prob > F      =  0.0001
                                                       R-squared     =  0.0639
                                                       Root MSE      =   .6095

                                  (Std. Err. adjusted for 40 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
     hh_nets |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          PC |   .1621849   .0423425     3.83   0.000      .076539    .2478308
         New |   .1524164   .0469003     3.25   0.002     .0575515    .2472812
------------------------------------------------------------------------------

. test PC=New;

 ( 1)  PC - New = 0

       F(  1,    39) =    0.02
            Prob > F =    0.8779

. reg hh_some PC New if hh_v==1, cluster(id_v) nocons;

Linear regression                                      Number of obs =    1728
                                                       F(  2,    39) =   16.02
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1087
                                                       Root MSE      =  .31075

                                  (Std. Err. adjusted for 40 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
     hh_some |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          PC |   .1033613   .0221483     4.67   0.000     .0585621    .1481606
         New |   .1189591   .0371386     3.20   0.003     .0438393     .194079
------------------------------------------------------------------------------

. test PC=New;

 ( 1)  PC - New = 0

       F(  1,    39) =    0.13
            Prob > F =    0.7203

. * ROWS D and E and test of equality;
. gen Low = price==1;

. gen High = price==2;

. reg hh_nets Low High if hh_v==1, cluster(id_v) nocons;

Linear regression                                      Number of obs =    1728
                                                       F(  2,    39) =   12.58
                                                       Prob > F      =  0.0001
                                                       R-squared     =  0.0739
                                                       Root MSE      =  .60624

                                  (Std. Err. adjusted for 40 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
     hh_nets |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Low |   .2264851   .0689016     3.29   0.002     .0871186    .3658517
        High |         .1    .026387     3.79   0.001     .0466273    .1533727
------------------------------------------------------------------------------

. test Low=High;

 ( 1)  Low - High = 0

       F(  1,    39) =    2.94
            Prob > F =    0.0944

. reg hh_some Low High if hh_v==1, cluster(id_v) nocons;

Linear regression                                      Number of obs =    1728
                                                       F(  2,    39) =   15.05
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1214
                                                       Root MSE      =  .30853

                                  (Std. Err. adjusted for 40 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
     hh_some |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Low |   .1485149   .0388166     3.83   0.000     .0700009    .2270288
        High |   .0728261   .0185158     3.93   0.000     .0353743    .1102779
------------------------------------------------------------------------------

. test Low=High;

 ( 1)  Low - High = 0

       F(  1,    39) =    3.10
            Prob > F =    0.0863

. * ROWS F and G and test of equality;
. * New households were assigned a household id larger than 1000;
. gen baseline = hid>1000;

. gen non_b = 1-baseline;

. reg hh_nets baseline non_b if new==0 & hh_v==1, cluster(id_v) nocon;

Linear regression                                      Number of obs =    1190
                                                       F(  2,    24) =    8.24
                                                       Prob > F      =  0.0019
                                                       R-squared     =  0.0577
                                                       Root MSE      =  .66109

                                  (Std. Err. adjusted for 25 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
     hh_nets |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    baseline |   .1985816   .0607396     3.27   0.003     .0732213    .3239418
       non_b |   .1508811    .045912     3.29   0.003     .0561234    .2456387
------------------------------------------------------------------------------

. test baseline=non_b;

 ( 1)  baseline - non_b = 0

       F(  1,    24) =    0.55
            Prob > F =    0.4638

. reg hh_some baseline non_b if new==0 & hh_v==1, cluster(id_v) nocon;

Linear regression                                      Number of obs =    1190
                                                       F(  2,    24) =   13.66
                                                       Prob > F      =  0.0001
                                                       R-squared     =  0.1043
                                                       Root MSE      =  .30454

                                  (Std. Err. adjusted for 25 clusters in id_v)
------------------------------------------------------------------------------
             |               Robust
     hh_some |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    baseline |   .1205674   .0264801     4.55   0.000     .0659151    .1752197
       non_b |   .0980176   .0246797     3.97   0.001     .0470812     .148954
------------------------------------------------------------------------------

. test baseline=non_b;

 ( 1)  baseline - non_b = 0

       F(  1,    24) =    0.59
            Prob > F =    0.4501

. log close;
      name:  <unnamed>
       log:  C:\Users\tarozzino\Dropbox\Experimental\AERR\Final\Stata\table4_cash.log
  log type:  text
 closed on:  12 Oct 2013, 13:06:17
---------------------------------------------------------------------------------------------------------------------------------------
