---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\tarozzino\Dropbox\Experimental\AERR\Final\Stata\tableA15_externalities.log
  log type:  text
 opened on:  12 Oct 2013, 13:07:04

. * In this dataset one observation is one surveyed household. For each household the variables denote the # of neighbors and # BISWA n
> eighbors 
> * within a given distance (in meters) indicated by the variable name;
. use "gpsdata";
(Data on # neighbours and # BISWA neighbors from 11 study villages)

. merge 1:m id_v id_hhno using "panel_biomarkers";

    Result                           # of obs.
    -----------------------------------------
    not matched                        17,700
        from master                         1  (_merge==1)
        from using                     17,699  (_merge==2)

    matched                               870  (_merge==3)
    -----------------------------------------

. tab vtype _merge, missing;

           |              _merge
     vtype | master on  using onl  matched ( |     Total
-----------+---------------------------------+----------
   Control |         0      5,703        278 |     5,981 
      Free |         0      5,804        592 |     6,396 
        MF |         0      6,192          0 |     6,192 
         . |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |         1     17,699        870 |    18,570 


. * Merging is OK with the exception of one single household that we drop;
. keep if _m==3;
(17700 observations deleted)

. drop _merge;

. * So now the data set is composed of individual-level observations for malaria status of individuals in GPS-ed households;
. renpfix n_ n;

. count if m1==.;
  258

. count if hb1==.;
  259

. drop if m1+hb1==.;
(259 observations deleted)

. foreach dist of numlist 5 10 20 30 40 50 100 150 200 300 400 {;
  2.         rename n`dist'_1 P`dist';
  3.         rename n`dist'_1_biswa B`dist';
  4.         gen BP`dist' = P`dist'*B`dist';
  5.         gen B_P`dist' = B`dist'/P`dist';
  6.         gen F_P`dist' = arm_free*P`dist';
  7.         gen F_B`dist' = arm_free*B`dist';
  8.         gen F_BP`dist'= arm_free*BP`dist';
  9.         gen F_B_P`dist' = arm_free*B_P`dist';
 10. };
(126 missing values generated)
(126 missing values generated)
(54 missing values generated)
(54 missing values generated)
(16 missing values generated)
(16 missing values generated)
(13 missing values generated)
(13 missing values generated)
(8 missing values generated)
(8 missing values generated)
(8 missing values generated)
(8 missing values generated)
(6 missing values generated)
(6 missing values generated)

. * Estimate mean # of neighbors and biswa neighbors for different radii;
. preserve;

. duplicates drop id_v id_hhno, force;

Duplicates in terms of id_v id_hhno

(478 observations deleted)

. foreach dist of numlist 5 10 20 30 40 50 100 150 200 300 400 {;
  2.         sum P`dist' B`dist';
  3. };

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
          P5 |       133    2.285714    1.823963          0          9
          B5 |       133    1.052632    1.182677          0          6

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         P10 |       133    5.676692    4.053709          0         22
         B10 |       133    2.578947    2.219782          0         10

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         P20 |       133    16.51128    11.75934          0         49
         B20 |       133    6.887218    5.469827          0         21

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         P30 |       133    28.96241    19.66477          0         82
         B30 |       133    10.76692    7.873899          0         35

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         P40 |       133    41.30075    29.38176          0        116
         B40 |       133    14.37594    11.28125          0         51

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         P50 |       133    52.96992    37.57154          0        152
         B50 |       133    17.47368    13.35958          0         58

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        P100 |       133    105.8421    80.08923          0        287
        B100 |       133    29.61654    23.27267          0         98

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        P150 |       133    142.0977     108.564          3        383
        B150 |       133    36.81955    29.80234          0        118

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        P200 |       133    163.4436    128.8883          3        419
        B200 |       133    39.47368    32.78594          0        127

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        P300 |       133     182.188     139.078          7        442
        B300 |       133    42.18045    34.24839          1        128

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        P400 |       133    191.5414    140.5149         10        447
        B400 |       133    43.64662    34.61656          4        128

. dis 2.6*0.035;
.091

. restore;

. * This to ensure replicability of the bootstrap;
. set seed 1;

. display in white "Radius = 5 meters";
Radius = 5 meters

. bootstrap, reps(250): areg m1 P5 B5 F_P5 F_B5, absorb(id_v) clu(id_v);
(running areg on estimation sample)

Bootstrap replications (250)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
............x.....................................   100
................................................x.   150
..................................................   200
.................................x................   250

Linear regression, absorbing indicators         Number of obs      =       611
                                                Replications       =       247
                                                Wald chi2(4)       =      1.68
                                                Prob > chi2        =    0.7949
                                                R-squared          =    0.1423
                                                Adj R-squared      =    0.1221
                                                Root MSE           =    0.3859

                                   (Replications based on 11 clusters in id_v)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
          m1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          P5 |  -.0155323   .0335099    -0.46   0.643    -.0812104    .0501458
          B5 |   .0222213     .07348     0.30   0.762    -.1217968    .1662394
        F_P5 |   .0284888   .0397879     0.72   0.474    -.0494942    .1064717
        F_B5 |   -.053478   .0817648    -0.65   0.513     -.213734     .106778
       _cons |   .2266393   .0526052     4.31   0.000      .123535    .3297437
------------------------------------------------------------------------------
        id_v |   absorbed                                      (11 categories)

. mat results = _b[P5]\_se[P5]\_b[B5]\_se[B5]\_b[F_P5]\_se[F_P5]\_b[F_B5]\_se[F_B5];

. foreach dist of numlist 10 20 30 40 {;
  2.                 display in white "Radius = `dist' meters";
  3.         rename P`dist' P;
  4.         rename B`dist' B;
  5.         rename F_B`dist' F_B;
  6.         rename F_P`dist' F_P;
  7.         bootstrap, reps(250): areg m1 P B F_P F_B, absorb(id_v) clu(id_v);
  8.         mat results = results,[_b[P]\_se[P]\_b[B]\_se[B]\_b[F_P]\_se[F_P]\_b[F_B]\_se[F_B]];
  9.         drop P B F_B F_P;
 10.         };
Radius = 10 meters
(running areg on estimation sample)

Bootstrap replications (250)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
.x................................................   150
..................................................   200
..................................................   250

Linear regression, absorbing indicators         Number of obs      =       611
                                                Replications       =       249
                                                Wald chi2(4)       =      3.76
                                                Prob > chi2        =    0.4398
                                                R-squared          =    0.1450
                                                Adj R-squared      =    0.1249
                                                Root MSE           =    0.3853

                                   (Replications based on 11 clusters in id_v)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
          m1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           P |  -.0006757   .0258973    -0.03   0.979    -.0514335    .0500821
           B |   .0239667    .042277     0.57   0.571    -.0588946    .1068281
         F_P |  -.0011611   .0287698    -0.04   0.968    -.0575488    .0552267
         F_B |  -.0348103   .0461984    -0.75   0.451    -.1253575    .0557369
       _cons |   .2177186   .0570991     3.81   0.000     .1058064    .3296309
------------------------------------------------------------------------------
        id_v |   absorbed                                      (11 categories)
Radius = 20 meters
(running areg on estimation sample)

Bootstrap replications (250)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250

Linear regression, absorbing indicators         Number of obs      =       611
                                                Replications       =       250
                                                Wald chi2(4)       =      1.05
                                                Prob > chi2        =    0.9027
                                                R-squared          =    0.1429
                                                Adj R-squared      =    0.1228
                                                Root MSE           =    0.3858

                                   (Replications based on 11 clusters in id_v)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
          m1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           P |    .001001   .0135781     0.07   0.941    -.0256116    .0276136
           B |    .010015    .045053     0.22   0.824    -.0782872    .0983173
         F_P |     .00094   .0138949     0.07   0.946    -.0262934    .0281734
         F_B |  -.0130933   .0454994    -0.29   0.774    -.1022705    .0760839
       _cons |    .175838   .0652181     2.70   0.007     .0480129    .3036631
------------------------------------------------------------------------------
        id_v |   absorbed                                      (11 categories)
Radius = 30 meters
(running areg on estimation sample)

Bootstrap replications (250)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
...................x..............................    50
..................................................   100
.......................x..........................   150
.....x............................................   200
..................................................   250

Linear regression, absorbing indicators         Number of obs      =       611
                                                Replications       =       247
                                                Wald chi2(4)       =      0.35
                                                Prob > chi2        =    0.9867
                                                R-squared          =    0.1411
                                                Adj R-squared      =    0.1209
                                                Root MSE           =    0.3862

                                   (Replications based on 11 clusters in id_v)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
          m1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           P |   .0019434   .0090593     0.21   0.830    -.0158125    .0196994
           B |  -.0000296   .0170188    -0.00   0.999    -.0333858    .0333265
         F_P |  -.0009605   .0093183    -0.10   0.918    -.0192239     .017303
         F_B |   .0005111   .0176984     0.03   0.977    -.0341771    .0351994
       _cons |   .1746745   .0681722     2.56   0.010     .0410594    .3082896
------------------------------------------------------------------------------
        id_v |   absorbed                                      (11 categories)
Radius = 40 meters
(running areg on estimation sample)

Bootstrap replications (250)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
................................................x.   250

Linear regression, absorbing indicators         Number of obs      =       611
                                                Replications       =       249
                                                Wald chi2(4)       =      0.21
                                                Prob > chi2        =    0.9949
                                                R-squared          =    0.1400
                                                Adj R-squared      =    0.1198
                                                Root MSE           =    0.3864

                                   (Replications based on 11 clusters in id_v)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
          m1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           P |  -.0016412   .0147313    -0.11   0.911    -.0305141    .0272317
           B |   .0051134   .0266433     0.19   0.848    -.0471065    .0573332
         F_P |   .0024069   .0148634     0.16   0.871    -.0267248    .0315385
         F_B |  -.0066525   .0269259    -0.25   0.805    -.0594264    .0461213
       _cons |   .2100137   .0997669     2.11   0.035     .0144741    .4055533
------------------------------------------------------------------------------
        id_v |   absorbed                                      (11 categories)

. mat rownames results = P_beta P_se B_beta B_se F_P_beta F_P_se F_B_beta F_B_se;

. mat list results, format(%8.3f);

results[8,5]
              c1      c2      c3      c4      c5
  P_beta  -0.016  -0.001   0.001   0.002  -0.002
    P_se   0.034   0.026   0.014   0.009   0.015
  B_beta   0.022   0.024   0.010  -0.000   0.005
    B_se   0.073   0.042   0.045   0.017   0.027
F_P_beta   0.028  -0.001   0.001  -0.001   0.002
  F_P_se   0.040   0.029   0.014   0.009   0.015
F_B_beta  -0.053  -0.035  -0.013   0.001  -0.007
  F_B_se   0.082   0.046   0.045   0.018   0.027

. cap log close;
